src/cf/InformationRegisters/пр_ОбращенияВСлужбуПоддержки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>пр_ОбращенияВСлужбуПоддержки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОбращения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОбращения</Name>
					<Comment>0 : пожелание, 1 : ошибка, 2 : вопрос</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеРоли</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОжидаемаяЦель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическоеПоведение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозможноПредоставлениеБазы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СогласиеОтправитьСведенияОПродукте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Прикрепления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/пр_ОбращенияВСлужбуПоддержки/Forms/Обращение/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Регистрируем событие
	Если ПустаяСтрока(Запись.Идентификатор) Тогда
		пр_ПоддержкаОтраслевыхРешений.ЗаписатьОперациюБизнесСтатистики("ПоддержкаОтраслевыхРешений.Обращение.Создание");
	Иначе
		пр_ПоддержкаОтраслевыхРешений.ЗаписатьОперациюБизнесСтатистики("ПоддержкаОтраслевыхРешений.Обращение.Открытие");
	КонецЕсли;
	
	// Инициализируем новый объект
	Если ПустаяСтрока(Запись.Идентификатор) Тогда
		
		// Определим ключевые параметры обращения
		Запись.ДатаОбращения = ТекущаяДатаСеанса();
		Параметры.Свойство("ВидОбращения", Запись.ВидОбращения);
		
		// Попытаемся заполнить информацию о пользователе
		Запись.Пользователь = Пользователи.ТекущийПользователь();
		ПользовательПриИзмененииНаСервере();
		
	КонецЕсли;
	
	// Вызываем переопределяемый обработчик события
	пр_ПоддержкаОтраслевыхРешенийПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка, РеквизитФормыВЗначение("Запись").Прикрепления);
	
	// Проверим состояние подсистемы обращений
	ОбновитьГруппуОписанияОшибки();
	
	// Обновим информацию о прикрепленных файлах
	ЭтотОбъект.РазмерФайловМаксимум = РегистрыСведений.пр_ОбращенияВСлужбуПоддержки.МаксимальныйРазмерПрикрепленийДляОбращения();
	ОбновитьНадписьРазмераФайла(ЭтотОбъект.Элементы.РазмерФайлов, ЭтотОбъект.РазмерФайловСумма, ЭтотОбъект.РазмерФайловМаксимум);
	
	НастроитьФормуПоВидуОбращения();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьЗаголовокФормы();
	
	Для каждого УдаляемаяГруппа Из ЭтотОбъект.Элементы.Файлы.ПодчиненныеЭлементы Цикл
		Для каждого УдаляемыйЭлемент Из УдаляемаяГруппа.ПодчиненныеЭлементы Цикл
			ЭтотОбъект.Элементы.Удалить(УдаляемыйЭлемент);
		КонецЦикла;
		ЭтотОбъект.Элементы.Удалить(УдаляемаяГруппа);
	КонецЦикла;
	
	ЭтотОбъект.РазмерФайловСумма = 0;
	ЭтотОбъект.Файлы.Очистить();
	
	Прикрепления = ТекущийОбъект.Прикрепления.Получить();
	
	Если ТипЗнч(Прикрепления)<>Тип("Массив") ИЛИ Прикрепления.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ОписаниеФайла Из Прикрепления Цикл
		
		Если ТипЗнч(ОписаниеФайла)<>Тип("Структура") Или (ТипЗнч(ОписаниеФайла) = Тип("Структура") И Не ОписаниеФайла.Свойство("ИмяФайла")) Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавитьФайлНаСервере(ОписаниеФайла.ИмяФайла, ОписаниеФайла.Размер,, ОписаниеФайла.Данные);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Финальная проверка, что выполнены все условия для отправки статистики
	Если ЭтотОбъект.КодОшибки<>0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Отправка обращения невозможна. Не выполнены все условия.'"),,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Если Не Запись.СогласиеОтправитьСведенияОПродукте Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Необходимо дать согласие на обработку персональных данных.'"),,
			"Запись.СогласиеОтправитьСведенияОПродукте",, Отказ);
		Возврат;
	КонецЕсли;
	
	// Инициализируем идентификатор обращения
	Если ПустаяСтрока(ТекущийОбъект.Идентификатор) Тогда
		ТекущийОбъект.Идентификатор = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	
	// Добавление прикрепленных файлов
	Прикрепления = Новый Массив();
	
	Для каждого Файл Из ЭтотОбъект.Файлы Цикл
		
		ОписаниеФайла = Новый Структура("ИмяФайла,Размер,Данные");
		ОписаниеФайла.ИмяФайла = Файл.ИмяФайла;
		ОписаниеФайла.Данные   = ПолучитьИзВременногоХранилища(Файл.Адрес);
		ОписаниеФайла.Размер   = Файл.Размер;
		
		Если Файл.Размер > 0 Тогда
			Прикрепления.Добавить(ОписаниеФайла);
		КонецЕсли;
		
	КонецЦикла;
	
	пр_ПоддержкаОтраслевыхРешенийПереопределяемый.ПередЗаписьюНаСервере(ЭтотОбъект, Прикрепления);
	
	ТекущийОбъект.Прикрепления = Новый ХранилищеЗначения(Прикрепления, Новый СжатиеДанных(9));
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Оперативную отправку выполняем только если номер еще не присвоен
	Если НЕ ПустаяСтрока(ТекущийОбъект.НомерОбращения) ИЛИ ЭтотОбъект.КодОшибки<>0 Тогда
		Возврат;
	КонецЕсли;
	
	// Регистрируем событие
	пр_ПоддержкаОтраслевыхРешений.ЗаписатьОперациюБизнесСтатистики("ПоддержкаОтраслевыхРешений.Обращение.Запись");
	
	// Вызываем обработчик сбора статистики с клиента
	пр_ПоддержкаОтраслевыхРешений.ОбновитьПараметрыПоДаннымСеанса(ИСТИНА);
	
	// Подготовим систему к непосредственной отправке обращения
	ПараметрыЦентраМониторинга = Новый Структура();
	ПараметрыЦентраМониторинга.Вставить("ОзнакомительныйПакетОтправлен", ЛОЖЬ);
	ПараметрыЦентраМониторинга.Вставить("ЗапросКонтактнойИнформации",    1);
	ПараметрыЦентраМониторинга.Вставить("КонтактнаяИнформацияИзменена",  ИСТИНА);
	
	УстановитьПривилегированныйРежим(Истина);
	ЦентрМониторингаСлужебный.УстановитьПараметрыЦентраМониторингаВнешнийВызов(ПараметрыЦентраМониторинга);
	УстановитьПривилегированныйРежим(Ложь);
	
	// Получим идентификатор информационной базы.
	ЦентрМониторингаСлужебный.ЗапускОтправкиОзнакомительногоПакета();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ПользовательПриИзмененииНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Запись.Пользователь) Тогда
		Возврат;
	КонецЕсли;
	
	// подтягивание контактных данных из справочника
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		Возврат;
	КонецЕсли;
	
	МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	Если НЕ МодульУправлениеКонтактнойИнформацией.СодержитКонтактнуюИнформацию(Запись.Пользователь) Тогда
		Возврат;
	КонецЕсли;
	
	ВидЭлектроннаяПочта = МодульУправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("EmailПользователя");
	ВидТелефон          = МодульУправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("ТелефонПользователя");
	
	Запись.ЭлектроннаяПочта = МодульУправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Запись.Пользователь, ВидЭлектроннаяПочта);
	Запись.Телефон          = МодульУправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Запись.Пользователь, ВидТелефон);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	ПользовательПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбращенияПриИзменении(Элемент)
	НастроитьФормуПоВидуОбращения();
КонецПроцедуры

&НаКлиенте
Процедура ТемаПриИзменении(Элемент)
	НастроитьФормуПоВидуОбращения();
КонецПроцедуры

// {УАТ}

&НаКлиенте
Процедура Подключаемый_ВариантРаботыПриИзменении(Элемент)
	НастроитьФормуПоВидуОбращения();
КонецПроцедуры

// {/УАТ}

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ДобавитьФайлНаСервере(ИмяФайла, Размер, Адрес=Неопределено, Данные=Неопределено)
	
	Если Данные<>Неопределено Тогда
		Адрес = ПоместитьВоВременноеХранилище(Данные, ЭтотОбъект.УникальныйИдентификатор);
	КонецЕсли;
	
	Файл = ЭтотОбъект.Файлы.Добавить();
	Файл.ИмяФайла  = ИмяФайла;
	Файл.Размер    = Размер;
	Файл.Адрес     = Адрес;
	
	ЭтотОбъект.РазмерФайловСумма = ЭтотОбъект.РазмерФайловСумма + Размер;
	
	// Создаем элементы управления
	НомерФайла = ЭтотОбъект.Файлы.Количество();
	Суффикс = "Файл"+Формат(НомерФайла, "ЧДЦ=0; ЧН=0; ЧГ=0");
	
	// Создаем группу для текущего файла
	ГруппаФайла = ЭтотОбъект.Элементы.Добавить("Группа"+Суффикс, Тип("ГруппаФормы"), ЭтотОбъект.Элементы.Файлы);
	ГруппаФайла.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаФайла.ЦветФона             = Новый Цвет(218, 240, 249);
	ГруппаФайла.ОтображатьЗаголовок  = Ложь;
	
	// Создаем кнопку открытия
	ОткрытьФайл = ЭтотОбъект.Элементы.Добавить("Открыть"+Суффикс, Тип("КнопкаФормы"), ГруппаФайла);
	ОткрытьФайл.ИмяКоманды           = "ОткрытьФайл";
	ОткрытьФайл.Вид                  = ВидКнопкиФормы.Гиперссылка;
	ОткрытьФайл.Заголовок            = Файл.ИмяФайла + "("+НадписьРазмераФайла(Размер)+")";
	ОткрытьФайл.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	
	// Создаем кнопку удаления
	УдалитьФайл = ЭтотОбъект.Элементы.Добавить("Удалить"+Суффикс, Тип("КнопкаФормы"), ГруппаФайла);
	УдалитьФайл.ИмяКоманды           = "УдалитьФайл";
	УдалитьФайл.Вид                  = ВидКнопкиФормы.Гиперссылка;
	
	Файл.ИмяГруппы = ГруппаФайла.Имя;
	
КонецПроцедуры // ДобавитьФайлНаСервере()

&НаКлиенте
Асинх Процедура ДобавитьФайл(Команда)
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.Заголовок          = "Выберите файл";
	ВыборФайла.ПолноеИмяФайла     = "";
	ВыборФайла.Фильтр             = НСтр("ru = 'Все форматы'") + "(*.*)|*.*";
	ВыборФайла.МножественныйВыбор = Ложь;
	
	ВыбранныеФайлы = Ждать ВыборФайла.ВыбратьАсинх();
	
	Если ТипЗнч(ВыбранныеФайлы)<>Тип("Массив") ИЛИ ВыбранныеФайлы.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ВыбранныеФайлы[0]);
	Размер = Ждать Файл.РазмерАсинх();
	
	Если ЭтотОбъект.РазмерФайловСумма+Размер > ЭтотОбъект.РазмерФайловМаксимум Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Общий размер прикреплений не должен превышать %1'"), НадписьРазмераФайла(ЭтотОбъект.РазмерФайловМаксимум));
		Ждать ПредупреждениеАсинх(ТекстСообщения,, НСтр("ru = 'Прикрепление файла'"));
		Возврат;
	КонецЕсли;
	
	Попытка
		Данные = Новый ДвоичныеДанные(Файл.ПолноеИмя);
		Адрес  = ПоместитьВоВременноеХранилище(Данные, ЭтотОбъект.УникальныйИдентификатор);
	Исключение
		ПричинаОшибки = ИнформацияОбОшибке();
		ТекстСообщения = СтрШаблон(НСтр("ru = 'При чтении данных файла %1 произошла ошибка: %2'"), Файл.Имя, ПодробноеПредставлениеОшибки(ПричинаОшибки));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	ДобавитьФайлНаСервере(Файл.Имя, Размер, Адрес);
	
	ОбновитьНадписьРазмераФайла(ЭтотОбъект.Элементы.РазмерФайлов, ЭтотОбъект.РазмерФайловСумма, ЭтотОбъект.РазмерФайловМаксимум);
	
КонецПроцедуры // ДобавитьФайл()

&НаСервере
Процедура УдалитьФайлНаСервере(ОписаниеФайла)
	
	Элементы.Удалить(Элементы.Найти(ОписаниеФайла.ИмяГруппы));
	ЭтотОбъект.РазмерФайловСумма = ЭтотОбъект.РазмерФайловСумма - ОписаниеФайла.Размер;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура УдалитьФайл(Команда)
	
	Если ЭтотОбъект.ТолькоПросмотр Тогда 
		ПредупреждениеАсинх(НСтр("ru = 'Редактирование обращения недоступно!'"));
		Возврат;
	КонецЕсли;
	
	ИмяГруппы = ТекущийЭлемент.Родитель.Имя;
	
	МассивФайлов = Файлы.НайтиСтроки(Новый Структура("ИмяГруппы", ИмяГруппы));
	Если МассивФайлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Файл = МассивФайлов[0];
	
	ОписаниеФайла = Новый Структура("ИмяГруппы, Размер");
	ОписаниеФайла.ИмяГруппы = Файл.ИмяГруппы;
	ОписаниеФайла.Размер    = Файл.Размер;
	
	// При записи в регистр файлы с нулевым размером пропускаются (см. ПередЗаписьюНаСервере)
	Файл.Размер = 0;
	УдалитьФайлНаСервере(ОписаниеФайла);
	
	ОбновитьНадписьРазмераФайла(ЭтотОбъект.Элементы.РазмерФайлов, ЭтотОбъект.РазмерФайловСумма, ЭтотОбъект.РазмерФайловМаксимум);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОткрытьФайл(Команда)
	
	ИмяГруппы = ТекущийЭлемент.Родитель.Имя;
	
	МассивФайлов = Файлы.НайтиСтроки(Новый Структура("ИмяГруппы", ИмяГруппы));
	Если МассивФайлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Файл       = МассивФайлов[0];
	ИмяФайла   = Файл.ИмяФайла;
	ЧастиИмени = СтрРазделить(ИмяФайла, ".");
	Расширение = ЧастиИмени[ЧастиИмени.ВГраница()];
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ВыборФайла.Заголовок          = "Укажите путь для сохранения файла";
	ВыборФайла.ПолноеИмяФайла     = ИмяФайла;
	ВыборФайла.Фильтр             = НСтр("ru = 'Все форматы'") + "(*.*)|*.*";
	ВыборФайла.МножественныйВыбор = Ложь;
	
	ПутьСохранения = Ждать ВыборФайла.ВыбратьАсинх();
	
	Если ПутьСохранения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Данные = ПолучитьИзВременногоХранилища(Файл.Адрес);
	Данные.Записать(ПутьСохранения[0]+"."+Расширение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОбработкиОшибкиОбращений(Результат, ДополнительныеПараметры=Неопределено) Экспорт
	
	ОбновитьГруппуОписанияОшибки();
	
КонецПроцедуры // ПослеОбработкиОшибкиОбращений()

&НаКлиенте
Процедура ОбработатьОшибкуОбращений(Команда)
	
	Если ЭтотОбъект.КодОшибки = 1 Тогда
		ОткрытьФорму("Обработка.пр_ПоддержкаОтраслевыхРешений.Форма.КонтактыСлужбыПоддержки");
		
	ИначеЕсли ЭтотОбъект.КодОшибки = 2 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОбработкиОшибкиОбращений", ЭтотОбъект);
		ОткрытьФорму("Обработка.пр_ПоддержкаОтраслевыхРешений.Форма.РегистрационнаяАнкета",,,,,, Оповещение);
		
	ИначеЕсли ЭтотОбъект.КодОшибки = 3 Тогда
		ВключитьОтправкуСтатистикиНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьНадписьРазмераФайла(Элемент, Сумма, Максимум)
	
	Элемент.Заголовок = СтрШаблон(НСтр("ru = '(используется %1 из %2)'"), НадписьРазмераФайла(Сумма), НадписьРазмераФайла(Максимум));
	
	Если Сумма > Максимум Тогда
		Элемент.ЦветТекста = Новый Цвет(255, 0, 0);
	Иначе
		Элемент.ЦветТекста = Новый Цвет();
	КонецЕсли;
	
КонецПроцедуры // ОбновитьНадписьРазмераФайла()

&НаКлиентеНаСервереБезКонтекста
Функция НадписьРазмераФайла(Размер)
	
	Если Размер>1024*1024 Тогда
		СокращенныйРазмер = Окр(Размер / 1024 / 1024, 1);
		Суффикс = НСтр("ru = 'Мб'");
	ИначеЕсли Размер>1024 Тогда
		СокращенныйРазмер = Окр(Размер / 1024, 1);
		Суффикс = НСтр("ru = 'Кб'");
	Иначе
		СокращенныйРазмер = Размер;
		Суффикс = НСтр("ru = 'Б'");
	КонецЕсли;
	
	Возврат Формат(СокращенныйРазмер, "ЧН=0; ЧГ=0") + Суффикс;
	
КонецФункции // НадписьРазмераФайла()

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	Если Запись.ВидОбращения = 0 Тогда
		ШаблонЗаголовка = НСтр("ru = 'Пожелание %1от %2'");
	ИначеЕсли Запись.ВидОбращения = 1 Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ошибка %1от %2'");
	ИначеЕсли Запись.ВидОбращения = 2 Тогда
		ШаблонЗаголовка = НСтр("ru = 'Вопрос %1от %2'");
	// {УАТ}
	ИначеЕсли Запись.ВидОбращения = 3 Или Запись.ВидОбращения = 4 Или Запись.ВидОбращения = 5 Тогда
		ЭтотОбъект.Заголовок = НСтр("ru='Заявка на подключение'");
	// {/УАТ}
	КонецЕсли;
	
	НомерОбращения = ?(ПустаяСтрока(Запись.НомерОбращения), "", Запись.НомерОбращения+" ");
	ДатаОбращения  = Формат(Запись.ДатаОбращения, "ДФ='dd.MM.yyyy H:mm'");
	// {УАТ}
	Если Не (Запись.ВидОбращения = 3 Или Запись.ВидОбращения = 4 Или Запись.ВидОбращения = 5) Тогда
	// {/УАТ}
		ЭтотОбъект.Заголовок = СтрШаблон(ШаблонЗаголовка, НомерОбращения, ДатаОбращения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьГруппуОписанияОшибки()
	
	// Проверим возможность отправки обращений в службу поддержки
	ЭтотОбъект.КодОшибки = РегистрыСведений.пр_ОбращенияВСлужбуПоддержки.ПроверитьВозможностьОтправкиОбращений(Элементы);
	
	// Меняем доступность объекта
	Если ПустаяСтрока(Запись.Идентификатор) Тогда
		ЭтотОбъект.ТолькоПросмотр = (ЭтотОбъект.КодОшибки<>0);
	КонецЕсли;
	
	// Корректируем видимость основных кнопок формы
	НетОшибки = (ЭтотОбъект.КодОшибки=0);
	Элементы.ФормаЗаписатьИЗакрыть.КнопкаПоУмолчанию = НетОшибки;
	Элементы.ФормаЗаписатьИЗакрыть.Видимость         = НетОшибки;
	
КонецПроцедуры // ОбновитьГруппуОписанияОшибки()

&НаСервере
Процедура ВключитьОтправкуСтатистикиНаСервере()
	
	// Производим настройку параметров подсистемы
	пр_ПоддержкаОтраслевыхРешений.ВключитьОтправкуСтатистики(ИСТИНА);
	
	// Инициализируем ключевые параметры клиента
	пр_ПоддержкаОтраслевыхРешений.ОбновитьПараметрыПоДаннымСеанса(ИСТИНА);
	
	// Проверим состояние подсистемы
	ОбновитьГруппуОписанияОшибки();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоВидуОбращения()
	
	// Отразим в заголовке вид текущего обращения
	УстановитьЗаголовокФормы();
	
	ЭтоПожелание = Запись.ВидОбращения = 0;
	ЭтоОшибка    = Запись.ВидОбращения = 1;
	ЭтоВопрос    = Запись.ВидОбращения = 2;
	
	ЭтотОбъект.Элементы.ВозможноПредоставлениеБазы.Видимость = ЭтоОшибка;
	ЭтотОбъект.Элементы.ФактическоеПоведение.Видимость = ЭтоПожелание Или ЭтоОшибка;
	Если ЭтоОшибка Тогда
		ЭтотОбъект.Элементы.ФактическоеПоведение.Заголовок = НСтр("ru = 'Порядок пошагового воспроизведения и полученный результат'");
	Иначе
		ЭтотОбъект.Элементы.ФактическоеПоведение.Заголовок = НСтр("ru = 'Полученный результат'");
	КонецЕсли;
	Если ЭтоВопрос Тогда
		ЭтотОбъект.Элементы.ОжидаемаяЦель.Заголовок = НСтр("ru = 'Что вызывает вопрос'");
		ЭтотОбъект.Элементы.ОжидаемаяЦель.Подсказка = НСтр("ru = 'Подробное описание возникающих сложностей'");
	Иначе
		ЭтотОбъект.Элементы.ОжидаемаяЦель.Заголовок = НСтр("ru = 'Ожидаемый результат'");
		ЭтотОбъект.Элементы.ОжидаемаяЦель.Подсказка = НСтр("ru = 'Подробное описание предполагаемого результата после выполнения вышеуказанных действий'");
	КонецЕсли;
	
	// Вызываем переопределяемую процедуру для управления добавленными элементами
	пр_ПоддержкаОтраслевыхРешенийПереопределяемый.НастроитьФормуПоВидуОбращения(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
